/**
 * ASCII 艺术图案输出模块
 */

/**
 * 输出 Sacre Moo ASCII 艺术图案到控制台
 * @returns ASCII艺术图案字符串
 */
export function getSprintSacreMooacreMoo(): void {
  console.log( `                        ..---.
                       // |\\||\\
\\   /                 ///;||\\|;\\               \\   /
  o               .__// \\\\____//\\_,.             o
/   \\              Y{_\\_/  \\'' = __/           /   \\
                   \\___   (o) (o)  }       /
                      /         :--'   么么牛
                 .---/ \\_    \\\`__\\-.   该程序受到牛爷庇护 
                /     \\\`--\\___(o'o) \\
         \\   / |     \\      \\\`===='  | \\   /
           o    \\\`.    \\\`.    .'    .    o
         /   \\   (\\\`.    \\\`. '    .')  /   \\
                 (  \\\`.    \\\`...'   )
                 (   .+.    \\\`-.    )
                 (.-'  .>-._   \\\`-. )
\\   /           (___.-'       \\\`-.___)            \\   /
  o              (                  )               o
/   \\            (                  )             /   \\
`);
}
